In [2]:
from pyspark.sql import SparkSession
from pyspark.sql import functions as f

In [4]:
spark = SparkSession.builder.getOrCreate()

In [6]:
df = spark.read.csv("train.csv", header=True, inferSchema=True)

In [7]:
df.createOrReplaceTempView("titanic")

##### SCOPE
Here I try to get the requests with spark methods and sql queries. The requests according to `titanic_simple_analysis.py` file:
1. Schema of the dataset.
2. Gender distribution of cleaned dataset.
3. City distribution of cleaned dataset.
4. Average of descriptive stats.
5. Describe of descriptive stats.
6. Median of descriptive stats.
7. Price averages according to classes.
8. Association between price and age.
9. Family size table.
10. Age group table. <br> <br> <br>
***
##### TODO
- [x] Schema of the dataset.
- [x] Gender distribution of cleaned dataset.
- [x] City distribution of cleaned dataset.
- [x] Average of descriptive stats.
- [x] Describe of descriptive stats.
- [ ] Median of descriptive stats.
- [x] Price averages according to classes.
- [ ] Association between price and age.
- [ ] Family size table.
- [ ] Age group table.

In [6]:
df.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [7]:
spark.sql("DESCRIBE titanic;").show()

+-----------+---------+-------+
|   col_name|data_type|comment|
+-----------+---------+-------+
|PassengerId|      int|   NULL|
|   Survived|      int|   NULL|
|     Pclass|      int|   NULL|
|       Name|   string|   NULL|
|        Sex|   string|   NULL|
|        Age|   double|   NULL|
|      SibSp|      int|   NULL|
|      Parch|      int|   NULL|
|     Ticket|   string|   NULL|
|       Fare|   double|   NULL|
|      Cabin|   string|   NULL|
|   Embarked|   string|   NULL|
+-----------+---------+-------+

In [8]:
cleaned_df = df.na.drop()
cleaned_df.show()

+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|     Ticket|    Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----------+--------+
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|   PC 17599| 71.2833|        C85|       C|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|     113803|    53.1|       C123|       S|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|      17463| 51.8625|        E46|       S|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|    PP 9549|    16.7|         G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|     113783|   26.55|       C103|       S|
|         22|       1|     2|Beesley, Mr. Lawr...|  male|34.0|    0|    0|     248698|    13.0|        D56|       S|
|         24|       1|     1|Sloper, Mr. Willi...|  male|28.0|    0|    0|     113788|    35.5|         A6|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|      19950|   263.0|C23 C25 C27|       S|
|         53|       1|     1|Harper, Mrs. Henr...|female|49.0|    1|    0|   PC 17572| 76.7292|        D33|       C|
|         55|       0|     1|Ostby, Mr. Engelh...|  male|65.0|    0|    1|     113509| 61.9792|        B30|       C|
|         63|       0|     1|Harris, Mr. Henry...|  male|45.0|    1|    0|      36973|  83.475|        C83|       S|
|         67|       1|     2|Nye, Mrs. (Elizab...|female|29.0|    0|    0| C.A. 29395|    10.5|        F33|       S|
|         76|       0|     3|Moen, Mr. Sigurd ...|  male|25.0|    0|    0|     348123|    7.65|      F G73|       S|
|         89|       1|     1|Fortune, Miss. Ma...|female|23.0|    3|    2|      19950|   263.0|C23 C25 C27|       S|
|         93|       0|     1|Chaffee, Mr. Herb...|  male|46.0|    1|    0|W.E.P. 5734|  61.175|        E31|       S|
|         97|       0|     1|Goldschmidt, Mr. ...|  male|71.0|    0|    0|   PC 17754| 34.6542|         A5|       C|
|         98|       1|     1|Greenfield, Mr. W...|  male|23.0|    0|    1|   PC 17759| 63.3583|    D10 D12|       C|
|        103|       0|     1|White, Mr. Richar...|  male|21.0|    0|    1|      35281| 77.2875|        D26|       S|
|        111|       0|     1|Porter, Mr. Walte...|  male|47.0|    0|    0|     110465|    52.0|       C110|       S|
|        119|       0|     1|Baxter, Mr. Quigg...|  male|24.0|    0|    1|   PC 17558|247.5208|    B58 B60|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----------+--------+
only showing top 20 rows

In [9]:
spark.sql(
    """
    SELECT * FROM titanic
    WHERE PassengerId IS NOT NULL
    AND Survived IS NOT NULL
    AND Pclass IS NOT NULL
    AND Name IS NOT NULL
    AND Sex IS NOT NULL
    AND Age IS NOT NULL
    AND SibSp IS NOT NULL
    AND Parch IS NOT NULL
    AND Ticket IS NOT NULL
    AND Fare IS NOT NULL
    AND Cabin IS NOT NULL
    AND Embarked IS NOT NULL
    """
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|     Ticket|    Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----------+--------+
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|   PC 17599| 71.2833|        C85|       C|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|     113803|    53.1|       C123|       S|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|      17463| 51.8625|        E46|       S|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|    PP 9549|    16.7|         G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|     113783|   26.55|       C103|       S|
|         22|       1|     2|Beesley, Mr. Lawr...|  male|34.0|    0|    0|     248698|    13.0|        D56|       S|
|         24|       1|     1|Sloper, Mr. Willi...|  male|28.0|    0|    0|     113788|    35.5|         A6|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|      19950|   263.0|C23 C25 C27|       S|
|         53|       1|     1|Harper, Mrs. Henr...|female|49.0|    1|    0|   PC 17572| 76.7292|        D33|       C|
|         55|       0|     1|Ostby, Mr. Engelh...|  male|65.0|    0|    1|     113509| 61.9792|        B30|       C|
|         63|       0|     1|Harris, Mr. Henry...|  male|45.0|    1|    0|      36973|  83.475|        C83|       S|
|         67|       1|     2|Nye, Mrs. (Elizab...|female|29.0|    0|    0| C.A. 29395|    10.5|        F33|       S|
|         76|       0|     3|Moen, Mr. Sigurd ...|  male|25.0|    0|    0|     348123|    7.65|      F G73|       S|
|         89|       1|     1|Fortune, Miss. Ma...|female|23.0|    3|    2|      19950|   263.0|C23 C25 C27|       S|
|         93|       0|     1|Chaffee, Mr. Herb...|  male|46.0|    1|    0|W.E.P. 5734|  61.175|        E31|       S|
|         97|       0|     1|Goldschmidt, Mr. ...|  male|71.0|    0|    0|   PC 17754| 34.6542|         A5|       C|
|         98|       1|     1|Greenfield, Mr. W...|  male|23.0|    0|    1|   PC 17759| 63.3583|    D10 D12|       C|
|        103|       0|     1|White, Mr. Richar...|  male|21.0|    0|    1|      35281| 77.2875|        D26|       S|
|        111|       0|     1|Porter, Mr. Walte...|  male|47.0|    0|    0|     110465|    52.0|       C110|       S|
|        119|       0|     1|Baxter, Mr. Quigg...|  male|24.0|    0|    1|   PC 17558|247.5208|    B58 B60|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----------+--------+
only showing top 20 rows

In [9]:
cleaned_df.groupBy("Sex").count().show()

+------+-----+
|   Sex|count|
+------+-----+
|female|   88|
|  male|   95|
+------+-----+

In [20]:
spark.sql(
    """
    SELECT COUNT(Sex) FROM titanic
    WHERE PassengerId IS NOT NULL
    AND Survived IS NOT NULL
    AND Pclass IS NOT NULL
    AND Name IS NOT NULL
    AND Sex IS NOT NULL
    AND Age IS NOT NULL
    AND SibSp IS NOT NULL
    AND Parch IS NOT NULL
    AND Ticket IS NOT NULL
    AND Fare IS NOT NULL
    AND Cabin IS NOT NULL
    AND Embarked IS NOT NULL
    GROUP BY Sex;
    """
).show()

+----------+
|count(Sex)|
+----------+
|        88|
|        95|
+----------+

In [18]:
cleaned_df.groupBy("Embarked").count().show()

+--------+-----+
|Embarked|count|
+--------+-----+
|       Q|    2|
|       C|   65|
|       S|  116|
+--------+-----+

In [21]:
spark.sql(
    """
    SELECT COUNT(Embarked) FROM titanic
    WHERE PassengerId IS NOT NULL
    AND Survived IS NOT NULL
    AND Pclass IS NOT NULL
    AND Name IS NOT NULL
    AND Sex IS NOT NULL
    AND Age IS NOT NULL
    AND SibSp IS NOT NULL
    AND Parch IS NOT NULL
    AND Ticket IS NOT NULL
    AND Fare IS NOT NULL
    AND Cabin IS NOT NULL
    AND Embarked IS NOT NULL
    GROUP BY Embarked;
    """
).show()

+---------------+
|count(Embarked)|
+---------------+
|              2|
|             65|
|            116|
+---------------+

descriptive stats
1. Pclass
2. Age
3. SibSp
4. Parch
5. Fare

In [37]:
df.select("*").groupBy().avg("Pclass", "Age", "SibSp", "Parch", "Fare").show()

+-----------------+-----------------+------------------+-------------------+----------------+
|      avg(Pclass)|         avg(Age)|        avg(SibSp)|         avg(Parch)|       avg(Fare)|
+-----------------+-----------------+------------------+-------------------+----------------+
|2.308641975308642|29.69911764705882|0.5230078563411896|0.38159371492704824|32.2042079685746|
+-----------------+-----------------+------------------+-------------------+----------------+

In [40]:
spark.sql(
    """ 
    SELECT AVG(Pclass), AVG(Age), AVG(SibSp), AVG(Parch), AVG(Fare) FROM titanic;
    """
).show()

+-----------------+-----------------+------------------+-------------------+----------------+
|      avg(Pclass)|         avg(Age)|        avg(SibSp)|         avg(Parch)|       avg(Fare)|
+-----------------+-----------------+------------------+-------------------+----------------+
|2.308641975308642|29.69911764705882|0.5230078563411896|0.38159371492704824|32.2042079685746|
+-----------------+-----------------+------------------+-------------------+----------------+

In [42]:
df.describe("Pclass", "Age", "SibSp", "Parch", "Fare").show()

+-------+------------------+------------------+------------------+-------------------+-----------------+
|summary|            Pclass|               Age|             SibSp|              Parch|             Fare|
+-------+------------------+------------------+------------------+-------------------+-----------------+
|  count|               891|               714|               891|                891|              891|
|   mean| 2.308641975308642| 29.69911764705882|0.5230078563411896|0.38159371492704824| 32.2042079685746|
| stddev|0.8360712409770491|14.526497332334035|1.1027434322934315| 0.8060572211299488|49.69342859718089|
|    min|                 1|              0.42|                 0|                  0|              0.0|
|    max|                 3|              80.0|                 8|                  6|         512.3292|
+-------+------------------+------------------+------------------+-------------------+-----------------+

24/12/03 16:05:18 WARN SparkStringUtils: Truncated the string representation of a plan since it was too large. This behavior can be adjusted by setting 'spark.sql.debug.maxToStringFields'.

In [20]:
spark.sql(
    """
    SELECT
        'Pclass' AS Pclass,
        COUNT(Pclass) AS count,
        AVG(Pclass) AS mean,
        STDDEV(Pclass) AS stddev,
        MIN(Pclass) AS min,
        MAX(Pclass) AS max,
        PERCENTILE_APPROX(Pclass, 0.5) AS median
    FROM titanic
    UNION
    SELECT
        'Age' AS Age,
        COUNT(Age) AS count,
        AVG(Age) AS mean,
        STDDEV(Age) AS stddev,
        MIN(Age) AS min,
        MAX(Age) AS max,
        PERCENTILE_APPROX(Age, 0.5) AS median
    FROM titanic
    UNION
    SELECT
        'SibSp' AS SibSp,
        COUNT(SibSp) AS count,
        AVG(SibSp) AS mean,
        STDDEV(SibSp) AS stddev,
        MIN(SibSp) AS min,
        MAX(SibSp) AS max,
        PERCENTILE_APPROX(SibSp, 0.5) AS median
    FROM titanic
    UNION
    SELECT
        'Parch' AS Parch,
        COUNT(Parch) AS count,
        AVG(Parch) AS mean,
        STDDEV(Parch) AS stddev,
        MIN(Parch) AS min,
        MAX(Parch) AS max,
        PERCENTILE_APPROX(Parch, 0.5) AS median
    FROM titanic
    UNION
    SELECT
        'Fare' AS Fare,
        COUNT(Fare) AS count,
        AVG(Fare) AS mean,
        STDDEV(Fare) AS stddev,
        MIN(Fare) AS min,
        MAX(Fare) AS max,
        PERCENTILE_APPROX(Fare, 0.5) AS median
    FROM titanic;
    """
).show()

+------+-----+-------------------+------------------+----+--------+-------+
|Pclass|count|               mean|            stddev| min|     max| median|
+------+-----+-------------------+------------------+----+--------+-------+
|Pclass|  891|  2.308641975308642|0.8360712409770491| 1.0|     3.0|    3.0|
|   Age|  714|  29.69911764705882|14.526497332334035|0.42|    80.0|   28.0|
| SibSp|  891| 0.5230078563411896|1.1027434322934315| 0.0|     8.0|    0.0|
| Parch|  891|0.38159371492704824|0.8060572211299488| 0.0|     6.0|    0.0|
|  Fare|  891|   32.2042079685746| 49.69342859718089| 0.0|512.3292|14.4542|
+------+-----+-------------------+------------------+----+--------+-------+

In [43]:
df.select("Pclass", "Fare").groupBy("Pclass").avg("Fare").orderBy("Pclass").show()

+------+------------------+
|Pclass|         avg(Fare)|
+------+------------------+
|     1| 84.15468749999992|
|     2| 20.66218315217391|
|     3|13.675550101832997|
+------+------------------+

In [28]:
spark.sql(
    """
    SELECT Pclass, AVG(Fare) FROM titanic
    GROUP BY Pclass ORDER BY Pclass;
    """
).show()

+------+------------------+
|Pclass|         avg(Fare)|
+------+------------------+
|     1| 84.15468749999992|
|     2| 20.66218315217391|
|     3|13.675550101832997|
+------+------------------+

In [31]:
price_age_df = df.filter(df.Fare.isNotNull())
p1 = price_age_df.filter((df.Age >= 0) & (df.Age <= 10)).agg(f.avg("Fare").alias("0-10"))
p2 = price_age_df.filter((df.Age >= 10) & (df.Age <= 20)).agg(f.avg("Fare").alias("10-20"))
p3 = price_age_df.filter((df.Age >= 20) & (df.Age <= 30)).agg(f.avg("Fare").alias("20-30"))
p4 = price_age_df.filter((df.Age >= 30) & (df.Age <= 40)).agg(f.avg("Fare").alias("30-40"))
p5 = price_age_df.filter((df.Age >= 40) & (df.Age <= 50)).agg(f.avg("Fare").alias("40-50"))
p6 = price_age_df.filter((df.Age >= 50) & (df.Age <= 60)).agg(f.avg("Fare").alias("50-60"))
p7 = price_age_df.filter((df.Age >= 60) & (df.Age <= 70)).agg(f.avg("Fare").alias("60-70"))
p8 = price_age_df.filter((df.Age >= 70) & (df.Age <= 80)).agg(f.avg("Fare").alias("70-80"))
columns = ["Age Range","Fare Average"]
datas = [
    ("0-10", p1.collect()[0][0]),
    ("10-20", p2.collect()[0][0]),
    ("20-30", p3.collect()[0][0]),
    ("30-40", p4.collect()[0][0]),
    ("40-50", p5.collect()[0][0]),
    ("50-60", p6.collect()[0][0]),
    ("60-70", p7.collect()[0][0]),
    ("70-80", p8.collect()[0][0])
]
new_df = spark.createDataFrame(datas, columns)
new_df.show()

+---------+------------------+
|Age Range|      Fare Average|
+---------+------------------+
|     0-10|30.434439062500008|
|    10-20|  29.4696247863248|
|    20-30|  27.1016648979592|
|    30-40|40.141317777777786|
|    40-50| 40.63093636363638|
|    50-60| 48.47692307692308|
|    60-70|47.642061904761896|
|    70-80|30.169057142857145|
+---------+------------------+

In [32]:
spark.sql(
    """
    SELECT AVG(Fare) FROM titanic;
    """
).show()

+----------------+
|       avg(Fare)|
+----------------+
|32.2042079685746|
+----------------+